package algorithms;
/*
사다리 

문제
 

아래의 그림과 같이 높은 빌딩 사이를 따라 좁은 길이 나있다. 두 개의 사다리가 있는데 길이가 x인 사다리는 오른쪽 빌딩의 아래를 받침대로 하여 왼쪽 빌딩에 기대져 있고 길이가 y인 사다리는 왼쪽 빌딩의 아래를 받침대로 하여 오른쪽 빌딩에 기대져 있다. 그리고 두 사다리는 땅에서부터 정확하게 c인 지점에서 서로 교차한다. 그렇다면 두 빌딩은 얼마나 떨어져 있는 걸까?

입력
 

첫째 줄에 차례대로 x, y, c에 해당하는 양의 실수 세 개가 입력된다.




출력
 

두 빌딩사이에 너비가 되는 수치를 소수점 4째 자리에서 반올림 하여 소수점 3째 자리까지 출력한다.



예제 입력 1 복사 
 30 40 10





예제 출력 1 복사 
 26.033







예제 입력 2 복사 
 12.619429 8.163332 3





예제 출력 2 복사 
 7.000







예제 입력 3 복사 
 10 10 3





예제 출력 3 복사 
 8.000







예제 입력 4 복사 
 10 10 1





예제 출력 4 복사 
 9.798


 */
public class Code_2022 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
